app/Controllers/Questions.php

SELECT *
FROM `questions`
---
    public function create()
    {
        if ($this->request->getMethod() === 'post') {
            $questions = new QuestionModel();
            $data = [
                'title' => $this->request->getPost('title'),
                'body' => $this->request->getPost('body'),
                'tags' => $this->request->getPost('tags'),
                'username' => $this->session->get('username'),
            ];
            if ($questions->save($data)) {
                $updatequestion = $questions->getId($data['title'], $data['body']);
                return redirect()->to('/answers?title=' . $data['title'] . '&body=' . $data['body'] . '&question_id=' . $updatequestion);
            } else {

            }
        }
        $questionModel = new QuestionModel();
        $data['questions'] = $questionModel->findAll();