app/Models/QuestionModel.php

SELECT `question_id`, `username`, `title`, `body`, `votes`
FROM `questions`
WHERE `username` = 'kavi'
---
    public function getQuestions($user)
    {
        $builder = $this->db->table('questions');
        $builder->select("question_id,username,title,body,votes");
        $builder->where('username', $user);
        $result = $builder->get();